<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Untitled Document</title>
<script language="JavaScript" type="text/JavaScript">
<!--
function MM_reloadPage(init) {  //reloads the window if Nav4 resized
  if (init==true) with (navigator) {if ((appName=="Netscape")&&(parseInt(appVersion)==4)) {
    document.MM_pgW=innerWidth; document.MM_pgH=innerHeight; onresize=MM_reloadPage; }}
  else if (innerWidth!=document.MM_pgW || innerHeight!=document.MM_pgH) location.reload();
}
MM_reloadPage(true);
//-->
</script>
<style type="text/css">
<!--
.style1 {font-family: Arial, Helvetica, sans-serif}
.style2 {
	font-size: 24px;
	color: #990000;
	font-weight: bold;
}
.style9 {font-family: Arial, Helvetica, sans-serif; font-size: 18px;}
body {
	background-color: #0099FF;
}
-->
</style>
</head>

<body>
<div id="Layer1" style="position:absolute; left:436px; top:95px; width:943px; height:618px; z-index:1">
  <p class="index-topic-added-before style1 style2" id="qu-es-un-software">&iquest;Qu&eacute; es un software?</p>
  <p class="style1">El t&eacute;rmino <em>software</em> es un vocablo ingl&eacute;s que fue tomado por&nbsp;otros idiomas y designa a&nbsp;todo componente intangible (y no f&iacute;sico) que forma parte de dispositivos como computadoras, tel&eacute;fonos m&oacute;viles o tabletas y que permite su funcionamiento.</p>
  <p class="style1">El software est&aacute; compuesto por un conjunto de&nbsp;aplicaciones y programas dise&ntilde;ados para cumplir diversas funciones dentro de un sistema. Adem&aacute;s, est&aacute; formado por la informacion del usuarioi y los&nbsp;datos&nbsp;procesados.</p>
  <p class="style1">Los programas que forman parte del software le indican al hardware (parte f&iacute;sica de un dispositivo), por medio de instrucciones, los pasos a seguir.</p>
  <p></p>
  <p class="style1">Los software se clasifican seg&uacute;n su funci&oacute;n en:</p>
  <ul>
    <li class="style1">Software de Sistema: Programas&nbsp;que dan al usuario la capacidad de&nbsp;relacionarse con el&nbsp;sistema, para ejercer control sobre el&nbsp;hardware. El software de sistema tambi&eacute;n se ofrece como soporte para otros programas. Por ejemplo:&nbsp;sistemas operativos o&nbsp;servidores.</li>
    <li class="style1">Softwares de programacion: Programas dise&ntilde;ados como herramientas que le permiten a un programador desarrollar programas inform&aacute;ticos. Se valen de t&eacute;cnicas y&nbsp;un <a href="https://concepto.de/lenguaje-de-programacion/"> </a>lenguaje de programacion espec&iacute;fico. Por ejemplo: compiladores o editores multimedia.</li>
    <li class="style1"><a href="https://concepto.de/software-de-aplicacion/"> </a> Software de Aplicacion:Programas dise&ntilde;ados para realizar una o m&aacute;s tareas espec&iacute;ficas a la vez, pueden ser autom&aacute;ticos o asistidos. Por ejemplo: videojuegos o reproductores multimedia.</li>
  </ul>
    
  <p class="style1"><img src="../../../Downloads/programming-code-abstract-technology-background-of-software-deve-picture-id629285904_0.jpg" width="932" height="582"></p>
  <p class="style1">&nbsp;</p>
  <p class="style1">&nbsp;</p>
</div>
</body>
</html>
